xmlcf/Documents/ВыплатаДивидендовКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВыплатаДивидендовКупонов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ВыплатыКупоновДивидендов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходРасходДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/InformationRegisters/ИсторияДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИсторияДивидендов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНаАкцию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВключаетНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xmlcf/AccumulationRegisters/АктивыОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АктивыОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/Documents/ВыплатаДивидендовКупонов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//СтруктураВозврата = ПолучитьТаблицуПартий(Отказ);
	//Для каждого СтрокаТаблицы из СтруктураВозврата.ТаблицаОстатки Цикл 
	//	// регистр ВыплатыКупоновДивидендов 
	//	Движения.ВыплатыКупоновДивидендов.Записывать = Истина;
	//	Движение = Движения.ВыплатыКупоновДивидендов.Добавить();
	//	Движение.Период = Дата;
	//	Движение.ДокументПартии = СтрокаТаблицы.ДокументПартии;
	//	Движение.Актив = Актив;
	//	Движение.Сумма = Сумма;
	//КонецЦикла;
	
	// регистр ОстаткиДенежныхСредств Приход
	//Приход дивидендов/купонов
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Портфель = Портфель;
	Движение.Сумма = Сумма;
	
	Если СуммаНалога <> 0 тогда
		// регистр ОстаткиДенежныхСредств Приход
		//Списание налога дивидендов/купонов если есть
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата + 1;
		Движение.Валюта = Валюта;
		Движение.Портфель = Портфель;
		Движение.Сумма = СуммаНалога;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуПартий(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияДивидендовСрезПоследних.Период КАК Период,
		|	ИсторияДивидендовСрезПоследних.Актив КАК Актив,
		|	ИсторияДивидендовСрезПоследних.СуммаНаАкцию КАК СуммаНаАкцию,
		|	ИсторияДивидендовСрезПоследних.СуммаВключаетНалог КАК СуммаВключаетНалог
		|ИЗ
		|	РегистрСведений.ИсторияДивидендов.СрезПоследних(&Период, Актив = &Актив) КАК ИсторияДивидендовСрезПоследних";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Период", Дата);
	
	ТаблицаИсторияДивидендов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаИсторияДивидендов.Количество() = 0 тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивыОстаткиОстатки.Актив КАК Актив,
		|	АктивыОстаткиОстатки.Валюта КАК Валюта,
		|	АктивыОстаткиОстатки.Портфель КАК Портфель,
		|	АктивыОстаткиОстатки.ДокументПартии КАК ДокументПартии,
		|	АктивыОстаткиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	АктивыОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.АктивыОстатки.Остатки(
		|			&ДатаСрезаРеестра,
		|			Портфель = &Портфель
		|				И Актив = &Актив) КАК АктивыОстаткиОстатки";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("ДатаСрезаРеестра", КонецДня(ТаблицаИсторияДивидендов[0].Период));
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	ТаблицаОстатки = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТаблицаИсторияДивидендов",ТаблицаИсторияДивидендов);
	СтруктураВозврата.Вставить("ТаблицаОстатки",ТаблицаОстатки);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

//// регистр ОстаткиДенежныхСредств Приход
//	Приход дивидендов/купонов
//	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
//	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//	Движение.Период = Дата;
//	Движение.Валюта = Валюта;
//	Движение.Портфель = Портфель;
//	Движение.Сумма = Сумма;

//// регистр ОстаткиДенежныхСредств Приход
//	Списание налога дивидендов/купонов если есть
//	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
//	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//	Движение.Период = Дата + 1;
//	Движение.Валюта = Валюта;
//	Движение.Портфель = Портфель;
//	Движение.Сумма = СуммаНалога;

	//// регистр ВыплатыКупоновДивидендов 
	//Движения.ВыплатыКупоновДивидендов.Записывать = Истина;
	//Движение = Движения.ВыплатыКупоновДивидендов.Добавить();
	//Движение.Период = Дата;
	//Движение.ДокументПартии = "";
	//Движение.Актив = Актив;
	//Движение.Сумма = Сумма;
